In [88]:
import pandas as pd
from bs4 import BeautifulSoup as bs
import requests
import pymongo
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine
from sqlalchemy.inspection import inspect 
from sqlalchemy import and_

# Team SIGMA

# Extract information

## How much time is spent on Education vs. PISA Score by Country

In [2]:
# read the time spent on different activities
excel_file = "Resources/Time-Use-in-OECD-Countries-OECD.xlsx"
time_use_df = pd.read_excel(excel_file)
time_use_df.head()

     Country   Category  Time (hours)
0  Australia  Paid work    211.146630
1    Austria  Paid work    279.532268
2    Belgium  Paid work    194.476452
3     Canada  Paid work    268.660610
4    Denmark  Paid work    199.771596

In [23]:
# Get unique values to create the catalog for the category table
categories = time_use_df["Category"].unique()

In [24]:
# Get unique values to create the catalog for the country table
countries = time_use_df["Country"].unique()

In [5]:
# read the PISA score from each country (educational score)
csv_file = "Resources/pisa-test-score-mean-performance-on-the-science-scale.csv"
pisa_df = pd.read_csv(csv_file)
pisa_df.head()

    Entity Code  Year  PISA: Mean performance on the science scale
0  Albania  ALB  2000                                   376.453214
1  Albania  ALB  2009                                   390.695746
2  Albania  ALB  2012                                   397.373214
3  Albania  ALB  2015                                   427.225000
4  Algeria  DZA  2015                                   375.745100

## Alcohol Consumption vs. Eating and Drinking time spent by Country

In [6]:
# read the Alcohol consumption by Country (pure alcohol in liters)
xmart_csv = "Resources/xmart.csv"
xmart_df = pd.read_csv(xmart_csv)
xmart_df.head()

,Country,Data Source,Beverage Types,2018,2017,2016,2015,2014,2013,2012,2011,2010
0,Afghanistan,Data source,All types,0.01,0.01,0.02,0.0,0.01,0.01,0.01,0.01,0.01
1,Afghanistan,Data source,Beer,0.00,0.00,0.00,0.0,0.00,0.01,0.01,0.01,0.01
2,Afghanistan,Data source,Wine,0.00,0.00,0.00,0.0,0.00,0.00,0.00,0.00,0.00
3,Afghanistan,Data source,Spirits,0.01,0.01,0.01,0.0,0.01,0.00,0.00,0.00,0.00
4,Afghanistan,Data source,Other alcoholic beverages,0.00,0.00,0.00,0.0,0.00,0.00,0.00,0.00,0.00

# Transform

## How much time is spent on Education vs. PISA Score by Country

In [7]:
# Clean dataframe to have only the most recent score data
year = pisa_df["Year"] == 2015
pisa_2015_df = pisa_df.loc[year]
pisa_2015_df.head()

       Entity Code  Year  PISA: Mean performance on the science scale
3     Albania  ALB  2015                                     427.2250
4     Algeria  DZA  2015                                     375.7451
9   Argentina  ARG  2015                                     432.2262
15  Australia  AUS  2015                                     509.9939
21    Austria  AUT  2015                                     495.0375

In [8]:
# Get only the time spent on education by country
education = time_use_df["Category"] == "Education"
time_use_education_df = time_use_df.loc[education]
time_use_education_df.head()

      Country   Category  Time (hours)
33  Australia  Education     27.018763
34    Austria  Education     26.897949
35    Belgium  Education     41.277172
36     Canada  Education     35.980637
37    Denmark  Education     25.044998

In [9]:
# Merge two data sets into one by country
education_df = time_use_education_df.merge(pisa_2015_df, left_on="Country", right_on="Entity")
education_df.head()

,Country,Category,Time (hours),Entity,Code,Year,PISA: Mean performance on the science scale
0,Australia,Education,27.018763,Australia,AUS,2015,509.9939
1,Austria,Education,26.897949,Austria,AUT,2015,495.0375
2,Belgium,Education,41.277172,Belgium,BEL,2015,501.9997
3,Canada,Education,35.980637,Canada,CAN,2015,527.7047
4,Denmark,Education,25.044998,Denmark,DNK,2015,501.9369

In [10]:
# delete columns that we don't need
education_df.drop(['Entity', 'Code', 'Category'], axis=1, inplace=True)
education_df.head()

     Country  Time (hours)  Year  PISA: Mean performance on the science scale
0  Australia     27.018763  2015                                     509.9939
1    Austria     26.897949  2015                                     495.0375
2    Belgium     41.277172  2015                                     501.9997
3     Canada     35.980637  2015                                     527.7047
4    Denmark     25.044998  2015                                     501.9369

In [11]:
education_df.columns

Index(['Country', 'Time (hours)', 'Year',
       'PISA: Mean performance on the science scale'],
      dtype='object')

## Alcohol Consumption vs. Eating and Drinking time spent by Country

In [12]:
# Filter data set to get time spent on "eating and drinking"
eat_var = time_use_df["Category"] == 'Eating and drinking'
eat_drink_time_df = time_use_df.loc[eat_var]
eat_drink_time_df.head()

       Country             Category  Time (hours)
231  Australia  Eating and drinking     89.061849
232    Austria  Eating and drinking     78.836406
233    Belgium  Eating and drinking     98.516408
234     Canada  Eating and drinking     64.819713
235    Denmark  Eating and drinking    119.153410

In [13]:
# Filter data set to get time spent on "eating and drinking"
all_var = xmart_df["Beverage Types"] == ' All types'
consumption_all_df = xmart_df.loc[all_var]
consumption_all_df.head()

,Country,Data Source,Beverage Types,2018,2017,2016,2015,2014,2013,2012,2011,2010
0,Afghanistan,Data source,All types,0.01,0.01,0.02,0.00,0.01,0.01,0.01,0.01,0.01
5,Albania,Data source,All types,4.70,4.75,4.67,4.54,4.33,4.54,4.74,5.42,5.28
10,Algeria,Data source,All types,0.58,0.58,0.60,0.58,0.54,0.50,0.43,0.40,0.35
15,Andorra,Data source,All types,9.75,9.93,9.94,9.85,9.89,10.07,10.34,10.46,10.58
20,Angola,Data source,All types,5.35,5.47,5.38,5.94,7.49,7.01,7.14,6.95,6.83

In [14]:
# get the average of the consumption of 5 years
consumption_all_df["Avg"] = consumption_all_df[["2010","2011","2012","2013","2014","2015"]].mean(axis=1)
consumption_all_df.head()

<ipython-input-14-79f839545059>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  consumption_all_df["Avg"] = consumption_all_df[["2010","2011","2012","2013","2014","2015"]].mean(axis=1)

,Country,Data Source,Beverage Types,2018,2017,2016,2015,2014,2013,2012,2011,2010,Avg
0,Afghanistan,Data source,All types,0.01,0.01,0.02,0.00,0.01,0.01,0.01,0.01,0.01,0.008333
5,Albania,Data source,All types,4.70,4.75,4.67,4.54,4.33,4.54,4.74,5.42,5.28,4.808333
10,Algeria,Data source,All types,0.58,0.58,0.60,0.58,0.54,0.50,0.43,0.40,0.35,0.466667
15,Andorra,Data source,All types,9.75,9.93,9.94,9.85,9.89,10.07,10.34,10.46,10.58,10.198333
20,Angola,Data source,All types,5.35,5.47,5.38,5.94,7.49,7.01,7.14,6.95,6.83,6.893333

In [15]:
# Merge two data sets into one by country
consumption_df = eat_drink_time_df.merge(consumption_all_df, on="Country")
consumption_df.head()

,Country,Category,Time (hours),Data Source,Beverage Types,2018,2017,2016,2015,2014,2013,2012,2011,2010,Avg
0,Australia,Eating and drinking,89.061849,Data source,All types,9.51,9.49,9.79,9.68,9.90,10.00,10.03,10.30,10.52,10.071667
1,Austria,Eating and drinking,78.836406,Data source,All types,11.80,11.70,11.70,11.60,12.20,11.60,12.10,11.90,12.10,11.916667
2,Belgium,Eating and drinking,98.516408,Data source,All types,9.42,9.42,9.42,10.36,10.57,10.33,10.09,10.14,10.27,10.293333
3,Canada,Eating and drinking,64.819713,Data source,All types,8.20,8.20,8.10,8.00,8.00,8.20,8.30,8.20,8.30,8.166667
4,Denmark,Eating and drinking,119.153410,Data source,All types,9.31,9.30,9.51,9.42,9.56,9.44,9.23,10.45,10.27,9.728333

In [16]:
consumption_df.columns

Index(['Country', 'Category', 'Time (hours)', 'Data Source', 'Beverage Types',
       '2018', '2017', '2016', '2015', '2014', '2013', '2012', '2011', '2010',
       'Avg'],
      dtype='object')

In [21]:
# create list to insert
education_list = []

In [22]:
# iterate the dataframe to populate list with only the relevant data needed for education scores
for index,row in education_df.iterrows():
    education = {
        "Country": row["Country"],
        "Time (hours)": row['Time (hours)'],
        "PISA: Mean performance on the science scale": row["PISA: Mean performance on the science scale"]
    }
    education_list.append(education)

In [17]:
# create list to insert
consumption_list = []

# iterate the dataframe to populate list with only the relevant data needed for alcohol consumption
for idx,row in consumption_df.iterrows():
    cons_dict = {
        "Country": row["Country"],
        "time_spent": row["Time (hours)"],
        "avg_consumption": row["Avg"]
    }
    consumption_list.append(cons_dict)

# Load

In [51]:
# PostgreSQL Connection
project_db = "etl_project_db" #poner nombre de base de datos que creemos
rds_connection_string = f"postgres:1234@localhost:5432/{project_db}"
engine = create_engine(f'postgresql://{rds_connection_string}')
engine.table_names()

['country', 'time', 'category', 'education', 'alcohol']

In [52]:
# Get the automap to get classes of the tables
Base = automap_base()
Base.prepare(engine, reflect=True)
Base.classes.keys()

['country', 'time', 'category', 'education', 'alcohol']

In [53]:
# get the session to work with the DB
session = Session(engine)

In [54]:
# get the classes to insert information into tables
Country = Base.classes.country
Category = Base.classes.category
Time = Base.classes.time
Education = Base.classes.education
Alcohol = Base.classes.alcohol

In [55]:
# Insert each register into country table
for country in countries:
    #print(f"Inserting - {country}")
    session.add(Country(name=country))
    
    
session.commit()

In [56]:
# insert each register into category table
for category in categories:
    session.add(Category(category=category))

session.commit()

In [83]:
# insert values into Time_use table including country and category
for idx,row in time_use_df.iterrows():
    # find objects to insert into table
    country_obj = session.query(Country).filter(Country.name == row["Country"]).limit(1).all()
    category_obj = session.query(Category).filter(Category.category == row["Category"]).limit(1).all()
    #print(country_obj[0].id, category_obj[0].id)
    # insert values into the table
    session.add(
        Time(
            id_country=country_obj[0].id, 
            id_category=category_obj[0].id, 
            time=row["Time (hours)"]
        )
    )
    
    
    
session.commit()

In [87]:
# get the ID's from the categories that we're going to use 
education_id = session.query(Category).filter(Category.category == "Education").limit(1).all()[0].id
alcohol_id = session.query(Category).filter(Category.category == "Eating and drinking").limit(1).all()[0].id

8

In [114]:
# insert into education vs time

for edu in education_list:
    # find objects to insert into table
    country_obj = session.query(Country).filter(Country.name == edu["Country"]).limit(1).all()

    time_obj = session.query(Time).filter(
        and_(Time.id_category == education_id, Time.id_country == country_obj[0].id)
    ).limit(1).all()

    # insert values into the table
    session.add(
        Education(
            id_time_use = time_obj[0].id, 
            score = edu["PISA: Mean performance on the science scale"]
        )
    )
    
session.commit()

In [116]:
# insert into alcohol vs time

for cons in consumption_list:
    # find objects to insert into table
    country_obj = session.query(Country).filter(Country.name == cons["Country"]).limit(1).all()

    time_obj = session.query(Time).filter(
        and_(Time.id_category == alcohol_id, Time.id_country == country_obj[0].id)
    ).limit(1).all()

    # insert values into the table
    session.add(
        Alcohol(
            id_time_use = time_obj[0].id, 
            consume_avg = cons["avg_consumption"]
        )
    )
    
session.commit()

In [29]:
# session.rollback()

In [117]:
for demo in session.query(Alcohol).limit(5):
    print(demo.id)

1
2
3
4
5

In [118]:
# close de session
session.close()

### previous MongoDB work

In [ ]:
# Initialize PyMongo to work with MongoDBs
#conn = 'mongodb://localhost:27017'
#client = pymongo.MongoClient(conn)

In [ ]:
# Define database
#db = client.etl_project_db

# create list to insert
#education_list = []

In [ ]:
# create collection and insert many results
#db.score_time_education.insert_many(education_list)

In [ ]:
# create collection and insert many results
#db.time_alcohol_consumption.insert_many(consumption_list)